
//**********************************************************************
//Відкрити форму по посиланню

&НаКлиенте
Процедура ОткрытьФорму(Команда)

ПоказатьЗначение(Неопределено, СсылкаНаОбъект); 

КонецПроцедуры



&НаКлиенте
Процедура ОткрытьФормуПроекта(Команда)

    П = Новый Структура;
    П.Вставить("Ключ", Проект);

   ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", П);

КонецПроцедуры

//***********************************************************************
//Відкрити форму з заповненням
&НаКлиенте
Процедура ОткрытьФорму(Команда)

П = Новый Структура;

П.Вставить("Основание", Проект);

ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", П);

КонецПроцедуры

//***********************************************************************
//Відкрити форму регістра відомостей

&НаКлиенте
Процедура ОткрытьФормуРегистра(Команда)

   КлючЗаписи = Новый Структура;
   КлючЗаписи.Вставить("Период", ТекущаяДата());
   КлючЗаписи.Вставить("ФизЛицо", Сотрудник);

   МассивКлюча = Новый Массив;
   МассивКлюча.Добавить(КлючЗаписи);

   КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.ФИОФизЛиц", МассивКлюча);

   П = Новый Структура("Ключ", КлючЗаписиРегистра);

   ОткрытьФорму("РегистрСведений.ФИОФизЛиц.ФормаЗаписи", П);

КонецПроцедуры

//***********************************************************************
//Відкрити форму з відбором

&НаКлиенте
Процедура ОткрытьФорму(Команда)

П = Новый Структура;
Отбор = Новый Структура;
Отбор.Вставить("Владелец", Контрагент);
П.Вставить("Отбор", Отбор);

ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", П);

 
КонецПроцедуры
