// Приклади створення типізованої таблиці значень
// Різні способи задання типів для колонок ТЗ

ОписаниеТиповСдОпер = Новый ТаблицаЗначений;
ОписаниеТиповСдОпер.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
ОписаниеТиповСдОпер.Колонки.Добавить("Трудоемкость",Новый ОписаниеТипов("Число"));
ОписаниеТиповСдОпер.Колонки.Добавить("Стоимость",Новый ОписаниеТипов("Число", ,,Новый КвалификаторыЧисла(15,2)));
ОписаниеТиповСдОпер.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
ОписаниеТиповСдОпер.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
ОписаниеТиповОпераций = Новый ОписаниеТипов(ОписаниеТиповСдОпер);
