Приклад №1:
&НаСервере
Функция ПросмотрДанныхВременныхТаблицЗапроса_1(Запрос, НомерВременнойТаблицы)// НомерВременнойТаблицы с 0

    Возврат Запрос.МенеджерВременныхТаблиц.Таблицы[НомерВременнойТаблицы].ПолучитьДанные().Выгрузить();
    //Возвращает таблицу значений с данными временной таблицы

КонецФункции
Приклад №2: 
&НаСервере
Функция ПросмотрДанныхВременныхТаблицЗапроса_2(Запрос, НомерВременнойТаблицы)// НомерВременнойТаблицы с 0

    Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными()[НомерВременнойТаблицы].Выгрузить();
    //Возвращает таблицу значений с данными временной таблицы

КонецФункции
Приклад №3: 
&НаСервере
Функция ПросмотрДанныхВременныхТаблицЗапроса_3(Запрос, НаименованиеВременнойТаблицы)// по имени ВТ

    Возврат Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(НаименованиеВременнойТаблицы).ПолучитьДанные().Выгрузить();
    //Возвращает таблицу значений с данными временной таблицы

КонецФункции