&НаКлиенте
Процедура ПечатьРасчетныхЛистов(Команда)
	
	Если Сотрудники.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Мас = Сотрудники.НайтиСтроки(Новый Структура("Печать", Истина));
	
	Если Мас.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не відмічено співробітників до друку", 60);     
		Возврат;
	КонецЕсли; 
	
	ИсточникДанных = Новый Массив;
	ИсточникДанных.Добавить(ДокументНачисления);
	
	Для Каждого Стр Из Мас Цикл 
		Если Стр.Печать Тогда
			ТабДок = Печать(ДокументНачисления, Стр.Сотрудник);  //функція яка поверне таб док на друк
            ПоказатьТабличныйДокументВБСП(ТабДок, ИсточникДанных, СтрШаблон("Розрахунковий лист %1", Стр.Сотрудник), "ПФ_MXL_дам_Макет_РасчетныеЛисты");

		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры      

&НаКлиенте
Процедура ПоказатьТабличныйДокументВБСП(ТабДок, ИсточникДанных, Знач ЗаголовокМакета = "Печатная форма", ИмяМакета)
	
	ИдентификаторПечатнойФормы 			= ИмяМакета;
	НазваниеПечатнойФормы 				= ЗаголовокМакета;
	
	КоллекцияПечатныхФорм 				= УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма 						= УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета 		= ИмяМакета;
	ПечатнаяФорма.ТабличныйДокумент 	= ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры