//дану ЗДФ поміщаємо у довідник зовнішніх друкованих форм в МБ. а по адресі "C:\Temp\налагодження\Звільнення.epf" знаходиться
//обробка яку відлагоджуємо у конфігураторі. 
//недолік - якщо сервер 1с і конфігуратор на різних серверах то працювати не буде...

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Адрес = "C:\Temp\налагодження\Звільнення.epf";
	Если Адрес <> ЭтотОбъект.ИспользуемоеИмяФайла Тогда
		обр = ВнешниеОбработки.Создать(Адрес, БезопасныйРежим());
		ЗаполнитьЗначенияСвойств(обр, ЭтотОбъект);
		обр.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		Возврат; 		
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ДрукованаФормаЗвільнення");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ИмяМакета = "МакетWORD";
		ДанныеМакетов = МакетыОбъектаДляПечати(ИмяМакета);
		
		ОфисныеДокументы = Новый Соответствие;
				
		Для Каждого Ссылка Из МассивОбъектов Цикл
			
			ИмяДокумента = Строка(Новый УникальныйИдентификатор);
			ИмяДокумента = Строка(Ссылка);
			
			АдресХранилищаОфисныйДокумент = НапечататьДокументOfficeOpenXML2(Ссылка, ДанныеМакетов, ИмяМакета);
			
			ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
			
		КонецЦикла;
		
		ПечатнаяФорма.СинонимМакета = "Друкована форма";
		ПечатнаяФорма.ОфисныеДокументы = ОфисныеДокументы;
		
	КонецЕсли;
	
КонецПроцедуры
